var days = {"จันทร์":["08.00-11.00 : 01418497(5)-SEMINAR"],
            "อังคาร":["08.00-10.00 : 01418442(1)-WEB TECH", "12.30-14.30 : 01418442(11)-WEB TECH"],
            "พุธ":["10.00-11.30 : 01418341(1)-IP", "12.00-14.00 : 01418331(1)-OS", "14.00-16.00 : 01418321(1)-SA", "16.00-18.00 : 01418321(11)-SA"],
            "พฤหัสบดี":["08.00-10.00 : 01418471(11)-SE", "11.00-13.00 : 01418471(1)-SE"],
            "ศุกร์":["10.00-11.30 : 01418341(1)-IP", "12.00-14.00 : 01418331(1)-OS"],
            "เสาร์":[""], "อาทิตย์":[""]}

function dayDetail(day){
    var subjects = days[day];
    var detail = "";
    for(var i = 0; i < subjects.length; i++){
        detail += subjects[i] + "<br>";
    }
    document.getElementById("showDayDetail").innerHTML = detail;
}